connector-tests/src/test/resources/com/github/veithen/visualwas/connector/proxy/invoke-stopApplication-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Header xmlns:ns0="admin" ns0:JMXMessageVersion="1.2.0" ns0:JMXVersion="1.2.0">
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:invoke xmlns:ns1="urn:AdminService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<objectname xsi:type="ns1:javax.management.ObjectName">rO0ABXNyABtqYXZheC5tYW5hZ2VtZW50Lk9iamVjdE5hbWUPA6cb620VzwMAAHhwdAC9V2ViU3BoZXJlOm5hbWU9QXBwbGljYXRpb25NYW5hZ2VyLHByb2Nlc3M9c2VydmVyMSxwbGF0Zm9ybT1wcm94eSxub2RlPXBob2Jvc05vZGUwMyx2ZXJzaW9uPTcuMC4wLjI3LHR5cGU9QXBwbGljYXRpb25NYW5hZ2VyLG1iZWFuSWRlbnRpZmllcj1BcHBsaWNhdGlvbk1hbmFnZXIsY2VsbD1waG9ib3NOb2RlMDNDZWxsLHNwZWM9MS4weA==</objectname>
<operationname xsi:type="xsd:string">stopApplication</operationname>
<params xsi:type="ns1:[Ljava.lang.Object;">rO0ABXVyABNbTGphdmEubGFuZy5PYmplY3Q7kM5YnxBzKWwCAAB4cAAAAAF0AAtpYm1hc3luY3JzcA==</params>
<signature xsi:type="ns1:[Ljava.lang.String;">rO0ABXVyABNbTGphdmEubGFuZy5TdHJpbmc7rdJW5+kde0cCAAB4cAAAAAF0ABBqYXZhLmxhbmcuU3RyaW5n</signature>
</ns1:invoke>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
